In [1]:
import pandas as pd
data = pd.read_csv('Salaries.csv',low_memory=False)

### 1. Display top 10 rows

In [43]:
data.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,0,567595.43,567595.43,2011,NaN,San Francisco,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245131,137811,0,538909.28,538909.28,2011,NaN,San Francisco,0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452,0,335279.91,335279.91,2011,NaN,San Francisco,0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120,198306,0,332343.61,332343.61,2011,NaN,San Francisco,0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401,9737,182234,0,326373.19,326373.19,2011,NaN,San Francisco,0
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082,0,316285.74,316285.74,2011,NaN,San Francisco,0
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492,89062,134426,0,315981.05,315981.05,2011,NaN,San Francisco,0
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576,0,51322,0,307899.46,307899.46,2011,NaN,San Francisco,0
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932,86362,40132,0,303427.55,303427.55,2011,NaN,San Francisco,0
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262,0,17115,0,302377.73,302377.73,2011,NaN,San Francisco,0

### 2.Check last 10 rows of the dataset

In [44]:
data.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148645,148646,Carolyn A Wilson,Human Services Technician,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148646,148647,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148647,148648,Joann Anderson,Communications Dispatcher 2,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148648,148649,Leon Walker,Custodian,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148649,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148650,148651,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148651,148652,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148652,148653,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,0
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618,0,-618.13,-618.13,2014,NaN,San Francisco,0

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [45]:
data.shape

(148654, 13)

### 4.  Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [46]:
data.info()
data.nunique()

# optimizing the data
data['Year'] = data['Year'].astype("category")
data['Agency'] = data['Agency'].astype("category")
data['Status'] = data['Status'].astype("category")
data['JobTitle'] = data['JobTitle'].astype("category")

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  int32
 4   OvertimePay       148654 non-null  int32
 5   OtherPay          148654 non-null  int32
 6   Benefits          148654 non-null  int32
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            148654 non-null  int32
dtypes: float64(3), int32(5), int64(2), object(3)
memory usage: 11.9+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  category
 3   BasePay           148654 non-null  int32
 4   OvertimePay       148654 non-null  int32
 5   OtherPay          148654 non-null  int32
 6   Benefits          148654 non-null  int32
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  category
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  category
 12  Status            148654 non-null  category
dtypes: category(4), float64(3), int32(4), int64(1), object(1)
memory usage: 8.7+ MB

### 5. Check Null Values In The Dataset

In [47]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                  0
OvertimePay              0
OtherPay                 0
Benefits                 0
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status                   0
dtype: int64

### 6. Drop ID, Notes, Agency, and Status Columns

In [48]:
data = pd.read_csv('Salaries.csv',low_memory=False)

data = data.drop(['Id','Notes','Agency','Status'],axis=1)

data.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011

### 7. Get Overall Statistics About The Dataframe

In [49]:
data.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049,148654,148654,112495,148654.000000,148654.000000,148654.000000
unique,110811,2159,109724,66162,84243,98647,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,872,57868,30068,1024,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

### 8. Find Occurrence of The Employee Names  (Top 5)

In [50]:
data['EmployeeName'].value_counts().nlargest(5)

EmployeeName
Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: count, dtype: int64

### 9.Find The Number of Unique Job Titles

In [51]:

data['JobTitle'].nunique()

2159

### 10.Total Number of Job Titles Contain Captain

In [52]:
len(data[data['JobTitle'].str.contains('Captain')])

411

### 11. Display All the Employee Names From Fire Department

In [53]:
# data[data['EmployeeName'].where(data['JobTitle'] == 'Fire')]

data[data['JobTitle'].str.contains('fire',case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

### 12. Find Minimum, Maximum, and Average BasePay

In [54]:
# Handling columns with values of mixed dtypes

data = pd.read_csv('Salaries.csv', low_memory=False)

for column in [data.columns[3], data.columns[4], data.columns[5], data.columns[6], data.columns[12]]:
    print(f"Unique values in {column}: {data[column].unique()}")

for column in [data.columns[3], data.columns[4], data.columns[5], data.columns[6], data.columns[12]]:
    non_numeric_values = pd.to_numeric(data[column], errors='coerce').isna()
    print(f"Non-numeric values in {column}: {data[column][non_numeric_values].unique()}")


default_value = 0
for column in [data.columns[3], data.columns[4], data.columns[5], data.columns[6], data.columns[12]]:
    data[column] = pd.to_numeric(data[column], errors='coerce').fillna(default_value)

for column in [data.columns[3], data.columns[4], data.columns[5], data.columns[6], data.columns[12]]:
    data[column] = data[column].astype(int)

Unique values in BasePay: ['167411.18' '155966.02' '212739.13' ... '6.04' '15.50' 'Not Provided']
Unique values in OvertimePay: ['0.0' '245131.88' '106088.18' ... '102.70' '56.77' 'Not Provided']
Unique values in OtherPay: ['400184.25' '137811.38' '16452.6' ... '15.35' 'Not Provided' '-618.13']
Unique values in Benefits: [nan '44430.12' '69810.19' ... '0.13' '1.24' 'Not Provided']
Unique values in Status: [nan 'PT' 'FT']
Non-numeric values in BasePay: [nan 'Not Provided']
Non-numeric values in OvertimePay: ['Not Provided']
Non-numeric values in OtherPay: ['Not Provided']
Non-numeric values in Benefits: [nan 'Not Provided']
Non-numeric values in Status: [nan 'PT' 'FT']

In [55]:
data['BasePay'].describe()

count    148654.000000
mean      66053.343940
std       42886.736895
min        -166.000000
25%       32792.000000
50%       64861.000000
75%       94605.000000
max      319275.000000
Name: BasePay, dtype: float64

### 13. Find job title of albert pardini

In [56]:
data[data['EmployeeName'] == 'ALBERT PARDINI']['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

### 14.How much albert pardini make including benefits

In [57]:
data.columns
data[data['EmployeeName'] == 'ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

### 15. .Display Name of The Person Having The Highest BasePay

In [58]:
data[data['BasePay'].max() == data['BasePay']]['EmployeeName']

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

### 16. Find the average BasePay of all employee per year

In [59]:
year_g = data.groupby('Year')
year_g.agg( {'BasePay': 'mean'} )

           BasePay
Year
2011  63595.525872
2012  65435.992819
2013  68509.468888
2014  66557.101251

### 17. Find Average BasePay of All Employee Per JobTitle

In [31]:
job_g = data.groupby('JobTitle')
job_g.agg( {'BasePay':'mean'} )

                                                     BasePay
JobTitle
ACCOUNT CLERK                                   43300.144578
ACCOUNTANT                                      46643.000000
ACCOUNTANT INTERN                               28732.229167
ACPO,JuvP, Juv Prob (SFERS)                     62290.000000
ACUPUNCTURIST                                   66374.000000
...                                                      ...
X-RAY LABORATORY AIDE                           47664.230769
X-Ray Laboratory Aide                           46085.970000
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS  52609.000000
Youth Comm Advisor                              39077.250000
ZOO CURATOR                                     43148.000000

[2159 rows x 1 columns]

### 18. Find Average BasePay of Employee Having Job Title ACCOUNTANT

In [39]:
accountants = data[data['JobTitle'] == 'ACCOUNTANT']

accountants['BasePay'].mean()

46643.0

### 19. Find Top 5 Most Common Jobs

In [42]:
data['JobTitle'].value_counts().nlargest(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64